# Pandas
## Instruções

Esta tarefa será feita completamente dentro deste _Jupyter notebook_ com as respostas inseridas
nas células fornecidas.
Todos os imports do python que são necessários são mostrados.
Siga as instruções deste _notebook_ para completar as tarefas.
Certifique-se de que os arquivos CSV estão na mesma pasta deste notebook.

In [28]:
# imports necessarios para completar a tarefa
import pandas as pd

## Questao 1: Importar um arquivo CSV
Escreva codigo para carregar o arquivo com dados de ex-alunos, `alumni.csv` em um `DataFrame` pandas chamado de `alumni`.

In [29]:
# questao 1
alumni = pd.read_csv('alumni.csv')
# Carregue o dataframe para mostrá-lo, após importar o arquivo
alumni

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"
...,...,...,...,...,...,...,...,...
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

## Questão 2: Entenda o dataset
Use os seguintes comandos do pandas para visualizar as informações do dataset:
a) head, b) tail, c) dtypes, d) info, e) describe

In [30]:
# a)
alumni.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

In [31]:
# b)
alumni.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [32]:
# c)
alumni.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)       object
dtype: object

In [33]:
# d)
alumni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

In [34]:
# e)
alumni.describe()

       Year Graduated         Salary           Fee
count       88.000000      88.000000     88.000000
mean      2006.477273   84090.909091  11708.727273
std          1.560852   21234.128008   1110.647949
min       2004.000000   35000.000000  10869.000000
25%       2005.000000   75000.000000  10968.000000
50%       2006.500000   75000.000000  11696.000000
75%       2008.000000   90000.000000  12058.250000
max       2009.000000  160000.000000  20960.000000

## Questao 3: Limpando o dataset (parte A)

a) Use o método `clean_currency` abaixo para limpar as vírculas e os cifrôes da coluna `Savings ($)` e ponha em uma nova coluna chamada `Savings`

In [35]:
def clean_currency(curr):
    return float(curr.replace(",", "").replace("$", ""))

clean_currency("$66,000")

66000.0

In [36]:
# Limpe os $ e , na coluna Savings ($) e insira na nova coluna Savings
# após, execute um df.head() poara verificar o DataFrame
# a)

alumni['Savings'] = alumni['Savings ($)'].apply(clean_currency)

alumni.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000",86000.0
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000",116000.0
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000",52000.0
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000",76000.0
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000",52000.0

b) execute um `alumni.dtypes.Savings` para verificar se a mudança ocorreu mesmo na tabela

In [37]:
# b)
alumni.dtypes.Savings

dtype('float64')

## Questão 4: Limpando o data set - parte B

a) Execute o comando `alumni["Gender].value_counts()` para verificar os campos "M" incorretos que devem ser convertidos para "Male"

In [38]:
# a)
alumni['Gender'].value_counts()

Gender
Male      46
Female    39
M          3
Name: count, dtype: int64

b) Agora use um `.replace` na coluna `Gender` para substituir os campos com valores "M" incorretos. _Dica:_ devemos usar `^M$`  para restringir o padrão e capturar somente a string M. Procure a documentação do método `replace` em strings.

In [39]:
# b)
alumni['Gender'].replace('M', 'Male')
# usando o ^M$ para definir o inicio e fim da string não funcionou, funcionou apenas com M

0       Male
1       Male
2     Female
3       Male
4     Female
       ...
83      Male
84      Male
85      Male
86    Female
87      Male
Name: Gender, Length: 88, dtype: object

c) O replace não altera a coluna `Gender`. Você deve usar agora uma atribuição `alumni["Gender"] = ` no valor que você fez o replace, para alterar a coluna

In [40]:
# c)
alumni['Gender'] = alumni['Gender'].replace('M', 'Male')

d) Agora execute o comando `value_counts` novamenta na coluna `Gender` para verificar os valores corretos "Male" e "Female"

In [41]:
# d)
alumni['Gender'].value_counts()

Gender
Male      49
Female    39
Name: count, dtype: int64

## Questão 5: Trabalhando com o data set

a) obtenha a [mediana](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.median.html) (`median`), b) [média](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.mean.html) (`mean`) e c) [desvio padrão](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.std.html) (`std`) para a coluna `Salary`.

In [42]:
# a)
round(alumni['Salary'].median(), 2)

75000.0

In [43]:
# b)
round(alumni['Salary'].mean(), 2)

84090.91

In [44]:
# c)
round(alumni['Salary'].std(), 2)

21234.13

d) Identifique que aluno pagou mais do que $15000 em taxas usando a coluna `Fee`.

In [45]:
# d)
aluno_valor_pago_maior_15000 = alumni[alumni['Fee'] > 15000.00]
aluno_valor_pago_maior_15000

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($),Savings
18,2006,Male,Married,Standard Diploma,No,140000,20960,"$72,000",72000.0